//! 局面の実装。

use crate::{KomaInf, Kyokumen};

impl Default for Kyokumen {
    fn default() -> Self {
        Kyokumen {
            banpadding: [KomaInf::Wall; 16],
            ban: [KomaInf::EMP; 16 * (9 + 2)],
            hand: [0; KomaInf::EHI as usize + 1 as usize],
            direct: [17, 1, -15, 16, -16, 15, -1, -17, 14, -18, 18, -14],
            can_move: [
                // Direct[0]=17,
                // |／
                //  ￣
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=1,
                // ↓
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-15,
                // ＼|
                // ￣
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=16,
                // ←
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-16,
                // →
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=15,
                //  __
                // |＼
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-1,
                // ↑
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-17
                // __
                // ／|
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1,
                    1, 1, 1, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=14,先手の桂馬
                //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                [
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-18,先手の桂馬
                //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                [
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-14,後手の桂馬
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=18,後手の桂馬
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
            ],
            // その方向に飛んで動くことが出来るか？
            // 飛車角香車と龍と馬しかそういう駒はない
            can_jump: [
                // Direct[0]=17,
                // ＼|
                // ￣
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                    0, 0, 0, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=1,
                // ↓
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-15,
                // ＼|
                // ￣
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                    0, 0, 0, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=16,
                // ←
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-16,
                // →
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=15,
                //  __
                // |＼
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                    0, 0, 0, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-1,
                // ↑
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0,
                    0, 0, 0, 0, 1,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-17
                // __
                // ／|
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
                    0, 0, 0, 1, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=14,先手の桂馬飛び
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-18,先手の桂馬飛び
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=-14,後手の桂馬飛び
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
                // Direct[0]=18,後手の桂馬飛び
                [
                    //  空空空空空空空空空空空空空空空空空歩香桂銀金角飛王と杏圭全金馬龍
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                    //  空歩香桂銀金角飛王と杏圭全金馬龍壁空空空空空空空空空空空空空空空
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0,
                ],
            ],
        }
    }
}
